# CouplerMainEndtreatment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerMainEndtreatment Property
ParameterTypeId Class See Also
---
"End Treatment 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerMainEndtreatment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerMainEndtreatment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerMainEndtreatment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace